app/views/employees/_form.html.erb


	Department : <%= f.collection_select :category_id, Category.find(:all), :id, :name ,{:prompt=> '---Select Category---'},{ :onchange=>"#{remote_function(:url=>load_subcategories_employees_path,:method=>:get,:with =>"'id='+value")}" }%><br><br>
---
SELECT `categories`.* FROM `categories`