app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees`
SELECT COUNT(*) FROM `employees`
SELECT `employees`.* FROM `employees` ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
 @employees = Employee.all
#@employees = Employee.paginate(:all, :page => params[:page], :order => 'created_at DESC')
 @employees= Employee.paginate(:all,:page =>page, :per_page =>per_page , :order =>"created_at  DESC")

SELECT `subcategories`.* FROM `subcategories` WHERE (category_id = '2')
---
def load_subcategories
  @subcategories = Subcategory.find(:all,:conditions => ['category_id = ?' ,params[:id]])

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
  def show
    @employee = Employee.find(params[:id])

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 3 LIMIT 1
---
  def edit
    @employee = Employee.find(params[:id])

INSERT INTO `employees` (`firstname`, `middlename`, `lastname`, `dob`, `address`, `phoneno`, `mailid`, `designation`, `category_id`, `subcategory_id`, `created_at`, `updated_at`, `file_file_name`, `file_content_type`, `file_file_size`, `file_updated_at`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`) VALUES ('', '', '', '2011-05-27', '', '', '', '', '', '', '2011-05-27 07:03:22', '2011-05-27 07:03:22', 'print', 'application/octet-stream', 3315, '2011-05-27 07:03:22', '565.jpg', 'image/jpeg', 31102, '2011-05-27 07:03:22')
---
  def create
    @employee = Employee.create(params[:employee])

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 3 LIMIT 1
UPDATE `employees` SET `avatar_file_name` = '565.jpg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 31102, `avatar_updated_at` = '2011-05-27 07:33:35', `updated_at` = '2011-05-27 07:33:35' WHERE `employees`.`id` = 3
---
  def update
    @employee = Employee.find(params[:id])

    respond_to do |format|
      if @employee.update_attributes(params[:employee])

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
UPDATE `employees` SET `avatar_file_name` = NULL, `avatar_content_type` = NULL, `avatar_file_size` = NULL, `avatar_updated_at` = NULL, `updated_at` = '2011-05-27 07:30:26' WHERE `employees`.`id` = 1
---
def delete_user_photo

@employee=Employee.find(params[:id])
@employee.avatar.destroy
  respond_to do |format|
      if @employee.save